{
    "options_unloadOnLeftClick": {
        "message": "Left click tabs to unload them."
    },
    "options_unloadOnMiddleClick": {
        "message": "Middle click tabs to unload them. (If the mouse button is released on the tab it was pressed on then that tab will be closed, there is currently no way to prevent this. To use this you need to press and hold the button and drag the mouse to another tab before releasing it.)"
    },
    "options_unloadOnRightClick": {
        "message": "Right click tabs to unload them. (Currently there is no way to stop the context menu from opening.)"
    },
    "options_selectOnLeftClick": {
        "message": "Prevent tab select with Left click. If this operation succeeds then the tab clicked will not be selected."
    },
    "options_modifierKeysInfo": {
        "message": "The click will only register if the selected modifier keys are pressed and the unselected modifier keys are released."
    },
    "options_modifierKeysAnyMode": {
        "message": "Any Key Mode: If checked then at least one of the selected modifier keys must be pressed for a click to register. It is not necessary to press all of the selected modifier keys. The state of the unselected modifier keys are ignored. If there are no selected modifier keys then a click will allways register."
    },
    "options_modifierKey_Ctrl": {
        "message": "Ctrl"
    },
    "options_modifierKey_Shift": {
        "message": "Shift"
    },
    "options_modifierKey_Alt": {
        "message": "Alt"
    },
    "options_modifierKey_Meta": {
        "message": "Meta (Command on macOS)"
    },
    "options_clickTimeoutInfo": {
        "message": "Measure the click duration. That is the time between a mouse down and a mouse up event. Ensure that it is within a certain intervall. Set a minimum time to only register long presses or set a maximum time to prevent triggering when dragging or long-pressing tabs."
    },
    "options_clickTimeoutMin": {
        "message": "Minimum click duration in milliseconds (set to 0 to disable): "
    },
    "options_clickTimeoutMax": {
        "message": "Maximum click duration in milliseconds (set to 0 to disable): "
    },
    "options_doubleClick_enabled": {
        "message": "Wait for double click."
    },
    "options_doubleClick_only": {
        "message": "If checked only double clicks will register; otherwise double clicks will cancel the operation."
    },
    "options_doubleClick_timeout": {
        "message": "Time in milliseconds between mouse down events to count as a double click: "
    },
    "options_onDrag_enabled": {
        "message": "Wait for long press without dragged tab. This is a special notification sent by Tree Style Tab when a tab is long pressed with the left mouse button. The notification is not sent if the tab is dragged. This can be used to allow the operation with long press but cancel when using drag and drop with tabs."
    },
    "options_onDrag_cancel": {
        "message": "If checked then cancel if an event is registered; otherwise only allow if an event is registered."
    },
    "options_onDrag_mouseUpTigger": {
        "message": "If checked then mouse up events will register as drag events."
    },
    "options_onDrag_timeout": {
        "message": "Time in milliseconds to wait for long press (should be notified after 500 milliseconds if the tab isn't dragged): "
    },
    "options_dontPreventTSTAction": {
        "message": "Don't prevent Tree Style Tab's default action while deciding if the click is valid."
    },
    "options_applyToAll": {
        "message": "Apply to both unloaded and loaded tabs."
    },
    "options_applyToUnloadedTabs": {
        "message": "Register click on unloaded tabs instead of loaded tabs."
    },
    "options_unloadInTSTContextMenu": {
        "message": "Add a context menu item in Tree Style Tab's context menu to unload a tab"
    },
    "options_dimUnloadedTabs": {
        "message": "Dim unloaded tabs"
    },
    "contextMenu_unloadTab": {
        "message": "&Suspend Tab",
        "description": "The title of the Tree Style Tab context menu item. The '&' is placed before the character that will become the keyboard shortcut."
    }
}